# Pandas Introduction

In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
# Read CSV into Pandas
baseRateData = pd.read_csv("Lessons/01-Intro_to_Python/BoEBaseRate.csv")

In [3]:
# Top rows of the dataframe
baseRateData.head()

   VALUE      DATE
0   11.5  1/2/1975
1   11.5  1/3/1975
2   11.5  1/6/1975
3   11.5  1/7/1975
4   11.5  1/8/1975

In [4]:
# Bottom rows of the dataframe
baseRateData.tail()

       VALUE       DATE
10481    0.5  6/17/2016
10482    0.5  6/20/2016
10483    0.5  6/21/2016
10484    0.5  6/22/2016
10485    0.5  6/23/2016

In [5]:
# To get the feature count, column names and data types
baseRateData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10486 entries, 0 to 10485
Data columns (total 2 columns):
VALUE    10486 non-null float64
DATE     10486 non-null object
dtypes: float64(1), object(1)
memory usage: 163.9+ KB

In [6]:
# To get a statistical summary of the numeric columns in a dataframe
baseRateData.describe()

              VALUE
count  10486.000000
mean       7.135085
std        4.515003
min        0.500000
25%        4.500000
50%        6.125000
75%       10.562500
max       17.000000

In [7]:
# To view just the column names
baseRateData.columns.tolist()

['VALUE', 'DATE']

In [8]:
# To access the data in a single column by name as a key entry:
baseRateData['VALUE'][0:10]

0    11.5
1    11.5
2    11.5
3    11.5
4    11.5
5    11.5
6    11.5
7    11.5
8    11.5
9    11.5
Name: VALUE, dtype: float64

In [9]:
# Or, by name as a parameter of the DF
baseRateData.VALUE[0:10]

0    11.5
1    11.5
2    11.5
3    11.5
4    11.5
5    11.5
6    11.5
7    11.5
8    11.5
9    11.5
Name: VALUE, dtype: float64

In [10]:
# To get the max value in a column
baseRateData['VALUE'].max()

17.0

In [11]:
# To get the min
baseRateData['VALUE'].min()

0.5

In [12]:
# To get the mean
baseRateData['VALUE'].mean()

7.135084884608049

In [13]:
# To add a new column to a dataframe, treat it like a dictionary
baseRateData['VALUE_PROP'] = baseRateData['VALUE'] / 100

baseRateData.head()

   VALUE      DATE  VALUE_PROP
0   11.5  1/2/1975       0.115
1   11.5  1/3/1975       0.115
2   11.5  1/6/1975       0.115
3   11.5  1/7/1975       0.115
4   11.5  1/8/1975       0.115

In [14]:
# Creating a new list with values based on dataframe values
colors = []
for value in baseRateData['VALUE']:
    if value < 5:
        colors.append('Green')
    else:
        colors.append('Red')
        
len(colors)

10486

In [15]:
# Populating a new dataframe column using an array of the same length
baseRateData['COLORS'] = colors

baseRateData.head()

   VALUE      DATE  VALUE_PROP COLORS
0   11.5  1/2/1975       0.115    Red
1   11.5  1/3/1975       0.115    Red
2   11.5  1/6/1975       0.115    Red
3   11.5  1/7/1975       0.115    Red
4   11.5  1/8/1975       0.115    Red

In [16]:
# To rename dataframe columns in place, changing 'inplace' allows you to create a new dataframe
baseRateData_r = baseRateData.rename(columns= {'VALUE': 'Value', 'DATE': 'Date', 'VALUE_PROP': 'value_prop', 'COLORS': 'colors'}, 
                                     inplace = False)
baseRateData_r.head()

   Value      Date  value_prop colors
0   11.5  1/2/1975       0.115    Red
1   11.5  1/3/1975       0.115    Red
2   11.5  1/6/1975       0.115    Red
3   11.5  1/7/1975       0.115    Red
4   11.5  1/8/1975       0.115    Red

In [17]:
# To reset the index from being the rowid to one of the columns
baseRateData_r.set_index(baseRateData_r['Date'], inplace=True)
baseRateData_r.head()

          Value      Date  value_prop colors
Date
1/2/1975   11.5  1/2/1975       0.115    Red
1/3/1975   11.5  1/3/1975       0.115    Red
1/6/1975   11.5  1/6/1975       0.115    Red
1/7/1975   11.5  1/7/1975       0.115    Red
1/8/1975   11.5  1/8/1975       0.115    Red

In [18]:
# To drop columns, specify a list by column name and "axis = 1"
baseRateData_r.drop(axis=1, labels=['Date', 'value_prop', 'colors'], inplace=True)
baseRateData_r.head()

          Value
Date
1/2/1975   11.5
1/3/1975   11.5
1/6/1975   11.5
1/7/1975   11.5
1/8/1975   11.5

In [19]:
baseRateData.head()

   VALUE      DATE  VALUE_PROP COLORS
0   11.5  1/2/1975       0.115    Red
1   11.5  1/3/1975       0.115    Red
2   11.5  1/6/1975       0.115    Red
3   11.5  1/7/1975       0.115    Red
4   11.5  1/8/1975       0.115    Red

In [20]:
# Selecting data from within Pandas using the index column, first using the default rowid based index
baseRateData.loc[0:6]

   VALUE       DATE  VALUE_PROP COLORS
0   11.5   1/2/1975       0.115    Red
1   11.5   1/3/1975       0.115    Red
2   11.5   1/6/1975       0.115    Red
3   11.5   1/7/1975       0.115    Red
4   11.5   1/8/1975       0.115    Red
5   11.5   1/9/1975       0.115    Red
6   11.5  1/10/1975       0.115    Red

In [21]:
# Now selecting data by using a range of dates from the date-based index
baseRateData_r.loc['1/2/1975':'1/10/1975']

           Value
Date
1/2/1975    11.5
1/3/1975    11.5
1/6/1975    11.5
1/7/1975    11.5
1/8/1975    11.5
1/9/1975    11.5
1/10/1975   11.5

In [22]:
# using .iloc always uses index location, even when the dataframe index is not a row_id
print(baseRateData.iloc[:4])
print(baseRateData_r.iloc[:4])

   VALUE      DATE  VALUE_PROP COLORS
0   11.5  1/2/1975       0.115    Red
1   11.5  1/3/1975       0.115    Red
2   11.5  1/6/1975       0.115    Red
3   11.5  1/7/1975       0.115    Red
          Value
Date
1/2/1975   11.5
1/3/1975   11.5
1/6/1975   11.5
1/7/1975   11.5

In [23]:
# We can also select a subset of columns and rows by slicing in 2D. 
# Here we select the 1st 4 rows and 1st 2 columns (NOTE: that the index counts as a column)
print(baseRateData.iloc[:4,:2],'\n')

print(baseRateData_r.iloc[:4,:1])

   VALUE      DATE
0   11.5  1/2/1975
1   11.5  1/3/1975
2   11.5  1/6/1975
3   11.5  1/7/1975

          Value
Date
1/2/1975   11.5
1/3/1975   11.5
1/6/1975   11.5
1/7/1975   11.5

In [24]:
# This also works with .loc by using the column names
print(baseRateData.loc[:4, 'DATE':'COLORS'],'\n') # 1st 5 rows, all columns from DATE to COLORS

baseRateData_r.loc['1/2/1975':'1/8/1975','Value'] # rows from Jan 1 - Jan 8 1975, 'Value' column only

       DATE  VALUE_PROP COLORS
0  1/2/1975       0.115    Red
1  1/3/1975       0.115    Red
2  1/6/1975       0.115    Red
3  1/7/1975       0.115    Red
4  1/8/1975       0.115    Red

Date
1/2/1975    11.5
1/3/1975    11.5
1/6/1975    11.5
1/7/1975    11.5
1/8/1975    11.5
Name: Value, dtype: float64

In [25]:
# One convenient thing this allows you to do is reset values.
# Convert first 20 rows COLOR from Red to Blue
baseRateData.loc[:19, 'COLORS'] = 'Blue'
baseRateData.head(22)

    VALUE       DATE  VALUE_PROP COLORS
0   11.50   1/2/1975      0.1150   Blue
1   11.50   1/3/1975      0.1150   Blue
2   11.50   1/6/1975      0.1150   Blue
3   11.50   1/7/1975      0.1150   Blue
4   11.50   1/8/1975      0.1150   Blue
5   11.50   1/9/1975      0.1150   Blue
6   11.50  1/10/1975      0.1150   Blue
7   11.50  1/13/1975      0.1150   Blue
8   11.50  1/14/1975      0.1150   Blue
9   11.50  1/15/1975      0.1150   Blue
10  11.50  1/16/1975      0.1150   Blue
11  11.50  1/17/1975      0.1150   Blue
12  11.25  1/20/1975      0.1125   Blue
13  11.25  1/21/1975      0.1125   Blue
14  11.25  1/22/1975      0.1125   Blue
15  11.25  1/23/1975      0.1125   Blue
16  11.25  1/24/1975      0.1125   Blue
17  11.00  1/27/1975      0.1100   Blue
18  11.00  1/28/1975      0.1100   Blue
19  11.00  1/29/1975      0.1100   Blue
20  11.00  1/30/1975      0.1100    Red
21  11.00  1/31/1975      0.1100    Red